---
type: EdgeArrayArray
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# EdgeArrayArray

`Autodesk.Revit.DB.EdgeArrayArray` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | EdgeArrayArray | — | `public EdgeArrayArray ()` |
| Method | Append | — | `public virtual void Append ( EdgeArray item )` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | ForwardIterator | — | `public virtual EdgeArrayArrayIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual void Insert ( EdgeArray item , int index )` |
| Method | ReverseIterator | — | `public virtual EdgeArrayArrayIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Item | — | `public virtual EdgeArray this [ int index ] { get ; set ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |